<?
    top('MAIN', $page);
    echo $page;
?>
<link rel="stylesheet" href="css/main.css">
<h1>Chess for all/Шахи для всіх</h1>
<h2>Тут ви зможете:</h2>
<ul>
    <li>Навчитися грати в <a href="/chessrules">шахи</a></li> 
    <li>Дізнатися останні <a href="/news">новини</a> зі світу шахів</li>
    <li>Розв'язувати шахові <a href="/login">задачі</a></li>
    <li>Стежити щаховими турнірами</li>
    <li>Знайти цікаві книги</li>
    <li>Зіграти шахи з <a href="/play">ботом</a></li>
</ul>
<p> Ша́хи — стратегічна[en] гра на спеціальній дошці, що має назву шахівниця й поділена на 64 світлі та темні клітини (поля), між 16 світлими (білими) і 16 темними (чорними) фігурами за встановленими для них правилами пересування[1]. У цю гру грають мільйони людей по всьому світі. Походить від стародавньої індійської гри чатуранґа, яка, крім того, є ймовірним предком східних стратегічних ігор сянці, чангі[en] і сьоґі. Шахи потрапили до Європи в 9 столітті, внаслідок завоювань Омейядів в Іспанії. Фігури набули своєї нинішньої сили в Іспанії наприкінці 15 століття; правила стандартизовано в 19 столітті.

Як одна з найпоширеніших спортивних ігор сучасності, поєднує в собі елементи мистецтва (уяви), науки (логічно-точний розрахунок) і спорту.</p>
<?
    bottom();
?>